{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "^",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "^": 0,
      " ": 1,
      "'": 2,
      "A": 3,
      "B": 4,
      "C": 5,
      "D": 6,
      "E": 7,
      "F": 8,
      "G": 9,
      "H": 10,
      "I": 11,
      "J": 12,
      "K": 13,
      "L": 14,
      "M": 15,
      "N": 16,
      "O": 17,
      "P": 18,
      "Q": 19,
      "R": 20,
      "S": 21,
      "T": 22,
      "U": 23,
      "V": 24,
      "W": 25,
      "X": 26,
      "Y": 27,
      "Z": 28,
      "TH": 29,
      "THE": 30,
      "IN": 31,
      "AN": 32,
      "ER": 33,
      "RE": 34,
      "ON": 35,
      "OU": 36,
      "EN": 37,
      "ED": 38,
      "AT": 39,
      "AND": 40,
      "TO": 41,
      "IS": 42,
      "AS": 43,
      "OF": 44,
      "OR": 45,
      "ING": 46,
      "AR": 47,
      "IT": 48,
      "ES": 49,
      "HE": 50,
      "AL": 51,
      "LE": 52,
      "ST": 53,
      "SE": 54,
      "AD": 55,
      "WH": 56,
      "CH": 57,
      "OM": 58,
      "BE": 59,
      "NO": 60,
      "LY": 61,
      "WI": 62,
      "LL": 63,
      "VE": 64
    },
    "merges": [
      "T H",
      "TH E",
      "I N",
      "A N",
      "E R",
      "R E",
      "O N",
      "O U",
      "E N",
      "E D",
      "A T",
      "AN D",
      "T O",
      "I S",
      "A S",
      "O F",
      "O R",
      "IN G",
      "A R",
      "I T",
      "E S",
      "H E",
      "A L",
      "L E",
      "S T",
      "S E",
      "A D",
      "W H",
      "C H",
      "O M",
      "B E",
      "N O",
      "L Y",
      "W I",
      "L L",
      "V E"
    ]
  }
}